NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/gatt/src/proxy.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "proxy.h"

#include "nrf_mesh_config_core.h"
#if MESH_FEATURE_GATT_PROXY_ENABLED

#include "proxy_config_packet.h"
#include "proxy_filter.h"
#include "core_tx.h"
#include "mesh_gatt.h"
#include "network.h"
#include "net_beacon.h"
#include "net_state.h"
#include "net_packet.h"
#include "nordic_common.h"
#include "nrf_mesh_externs.h"
#include "nrf_mesh_events.h"
#include "nrf_mesh_utils.h"
#include "log.h"
#include "rand.h"
#include "enc.h"
#include "mesh_adv.h"
#include "timer_scheduler.h"
#include "cache.h"
#include "mesh_config_entry.h"
#include "mesh_opt_gatt.h"

#if MESH_GATT_PROXY_NODE_IDENTITY_DURATION_MS > 60000
#error The MESH_GATT_PROXY_NODE_IDENTITY_DURATION_MS shall not be greater than 60,000 ms
#endif

#define PROXY_UUID_SERVICE 0x1828
#define PROXY_UUID_CHAR_TX 0x2ade
#define PROXY_UUID_CHAR_RX 0x2add

#define PROXY_ADV_DATA_NODE_ID_HASH_SIZE 8
#define PROXY_ADV_DATA_NODE_ID_RAND_SIZE 8

#define ADV_TIMEOUT_INFINITE (0)

#define ADV_NETWORK_ITERATE_INTERVAL_US     SEC_TO_US(10)

/** Macro for copying a packed big-endian address list into a regular uint16_t array. */
#define ADDRS_LIST_ENDIANESS_SWAP_AND_COPY(P_ADDRS, P_ADDRS_PACKED, ADDR_COUNT) \
    do {                                                                \
        for (uint32_t i = 0; i < addr_count; ++i)                       \
        {                                                               \
            P_ADDRS[i] = LE2BE16(P_ADDRS_PACKED[i]);                    \
        }                                                               \
    } while (0)

NRF_MESH_STATIC_ASSERT(IS_POWER_OF_2(MESH_GATT_PROXY_BEACON_CACHE_SIZE));

typedef uint8_t beacon_cache_entry_t[NET_BEACON_CMAC_SIZE];

typedef enum
{
    PROXY_ADV_TYPE_NETWORK_ID,
    PROXY_ADV_TYPE_NODE_ID,
} proxy_adv_type_t;

typedef struct
{
    proxy_filter_t filter;
    bool connected;
    nrf_mesh_key_refresh_phase_t kr_phase;
    const nrf_mesh_beacon_info_t * p_pending_beacon_info;
    uint8_t * p_alloc_packet;
    core_tx_bearer_t bearer;
} proxy_connection_t;


typedef struct __attribute((packed))
{
    uint8_t type; /**< See @ref proxy_adv_type_t for legal values. */
    union __attribute((packed))
    {
        struct __attribute((packed))
        {
            uint8_t network_id[NRF_MESH_NETID_SIZE];
        } network_id;
        struct __attribute((packed))
        {
            uint8_t hash[PROXY_ADV_DATA_NODE_ID_HASH_SIZE];
            uint8_t random[PROXY_ADV_DATA_NODE_ID_RAND_SIZE];
        } node_id;
    } params;
} proxy_adv_service_data_t;

typedef struct __attribute((packed))
{
    uint8_t padding[6];
    uint8_t random[PROXY_ADV_DATA_NODE_ID_RAND_SIZE];
    uint16_t address;
} proxy_adv_node_id_hash_input_t;

static core_tx_alloc_result_t core_tx_packet_alloc_cb(core_tx_bearer_t * p_bearer, const core_tx_alloc_params_t * p_params);
static void core_tx_packet_send_cb(core_tx_bearer_t * p_bearer, const uint8_t * p_packet, uint32_t packet_length);
static void core_tx_packet_discard_cb(core_tx_bearer_t * p_bearer);

static void adv_start(proxy_adv_type_t proxy_adv_type, bool interleave_networks);
/*****************************************************************************
* Static globals
*****************************************************************************/
static const core_tx_bearer_interface_t m_interface = {core_tx_packet_alloc_cb,
                                                       core_tx_packet_send_cb,
                                                       core_tx_packet_discard_cb};
static proxy_connection_t m_connections[MESH_GATT_CONNECTION_COUNT_MAX];
static nrf_mesh_evt_handler_t m_mesh_evt_handler;
static bool m_enabled = PROXY_ENABLED_DEFAULT;

static struct
{
    bool running;
    proxy_adv_type_t type;
    timer_event_t timer;
    const nrf_mesh_beacon_info_t * p_net_beacon_info;
    nrf_mesh_key_refresh_phase_t kr_phase;
} m_advertising;

static beacon_cache_entry_t m_beacon_cache_entries[MESH_GATT_PROXY_BEACON_CACHE_SIZE];
static cache_t m_beacon_cache;

/*****************************************************************************
* Static functions
*****************************************************************************/

static inline uint16_t connection_index(const proxy_connection_t * p_connection)
{
    return (p_connection - &m_connections[0]);
}

static void connection_reset(proxy_connection_t * p_connection)
{
    proxy_filter_clear(&p_connection->filter);
    p_connection->p_pending_beacon_info = NULL;
}

static inline uint32_t active_connection_count(void)
{
    uint32_t count = 0;
    for (uint32_t i = 0; i < MESH_GATT_CONNECTION_COUNT_MAX; ++i)
    {
        if (m_connections[i].connected)
        {
            count++;
        }
    }
    return count;
}

static void adv_data_network_id_set(const uint8_t * p_network_id)
{
    proxy_adv_service_data_t service_data;
    service_data.type = PROXY_ADV_TYPE_NETWORK_ID;
    memcpy(&service_data.params.network_id.network_id[0], p_network_id, NRF_MESH_NETID_SIZE);

    uint32_t size = (offsetof(proxy_adv_service_data_t, params) + NRF_MESH_NETID_SIZE);

