NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/gatt/src/proxy.c
    mesh_adv_data_set(PROXY_UUID_SERVICE, (uint8_t *) &service_data, size);
}

static void adv_data_node_id_set(const uint8_t * p_identity_key, uint16_t src)
{
    /* Hash = AES(Padding | Random | Address) */
    proxy_adv_node_id_hash_input_t hash_enc_input;
    memset(hash_enc_input.padding, 0, sizeof(hash_enc_input.padding));
    rand_hw_rng_get(hash_enc_input.random, sizeof(hash_enc_input.random));
    hash_enc_input.address = LE2BE16(src);

    uint8_t hash_enc_output[NRF_MESH_KEY_SIZE];
    enc_aes_encrypt(p_identity_key, (uint8_t *) &hash_enc_input, hash_enc_output);

    proxy_adv_service_data_t service_data;
    service_data.type = PROXY_ADV_TYPE_NODE_ID;
    /* Need last 8 bytes, as the spec considers the hash a big endian number */
    memcpy(service_data.params.node_id.hash,
           &hash_enc_output[NRF_MESH_KEY_SIZE - PROXY_ADV_DATA_NODE_ID_HASH_SIZE],
           PROXY_ADV_DATA_NODE_ID_HASH_SIZE);
    memcpy(service_data.params.node_id.random, hash_enc_input.random, PROXY_ADV_DATA_NODE_ID_RAND_SIZE);

    uint32_t size = (((uint32_t) &service_data.params - (uint32_t) &service_data) +
                     sizeof(service_data.params.node_id));

    mesh_adv_data_set(PROXY_UUID_SERVICE, (uint8_t *) &service_data, size);
}

/**
 * Clean up the advertiser state.
 */
static void on_adv_end(void)
{
    timer_sch_abort(&m_advertising.timer);
    m_advertising.running = false;
}

static uint32_t packet_alloc(proxy_connection_t * p_connection,
                             mesh_gatt_pdu_type_t pdu_type,
                             uint32_t length,
                             nrf_mesh_tx_token_t token)
{
    NRF_MESH_ASSERT(p_connection->p_alloc_packet == NULL);
    p_connection->p_alloc_packet = mesh_gatt_packet_alloc(connection_index(p_connection),
                                                          pdu_type,
                                                          length,
                                                          token);
    return (p_connection->p_alloc_packet ? NRF_SUCCESS : NRF_ERROR_NO_MEM);
}

static void packet_send(proxy_connection_t * p_connection)
{
    NRF_MESH_ASSERT(p_connection->p_alloc_packet);
    if(mesh_gatt_packet_send(connection_index(p_connection), p_connection->p_alloc_packet) != NRF_SUCCESS)
    {
        mesh_gatt_packet_discard(connection_index(p_connection), p_connection->p_alloc_packet);
    }
    p_connection->p_alloc_packet = NULL;
}

static void packet_discard(proxy_connection_t * p_connection)
{
    NRF_MESH_ASSERT(p_connection->p_alloc_packet);
    mesh_gatt_packet_discard(connection_index(p_connection), p_connection->p_alloc_packet);
    p_connection->p_alloc_packet = NULL;
}

static uint32_t beacon_packet_send(proxy_connection_t * p_connection,
                                   const nrf_mesh_beacon_secmat_t * p_beacon_secmat,
                                   uint32_t iv_index,
                                   net_state_iv_update_t iv_update,
                                   bool key_refresh)
{
    if (packet_alloc(p_connection, MESH_GATT_PDU_TYPE_MESH_BEACON, NET_BEACON_BUFFER_SIZE, NRF_MESH_INITIAL_TOKEN) ==
        NRF_SUCCESS)
    {
        NRF_MESH_ERROR_CHECK(net_beacon_build(p_beacon_secmat,
                                              iv_index,
                                              iv_update,
                                              key_refresh,
                                              p_connection->p_alloc_packet));
        packet_send(p_connection);
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_NO_MEM;
    }
}

static void beacon_cycle_trigger(proxy_connection_t * p_connection)
{
    nrf_mesh_beacon_info_next_get(NULL, &p_connection->p_pending_beacon_info, &p_connection->kr_phase);
}

static void beacon_cycle_send(proxy_connection_t * p_connection)
{
    while (p_connection->p_pending_beacon_info &&
           (beacon_packet_send(p_connection,
                               nrf_mesh_beacon_secmat_from_info(p_connection->p_pending_beacon_info, p_connection->kr_phase),
                               net_state_beacon_iv_index_get(),
                               net_state_iv_update_get(),
                               p_connection->kr_phase) == NRF_SUCCESS))
    {
        nrf_mesh_beacon_info_next_get(NULL,
                                      &p_connection->p_pending_beacon_info,
                                      &p_connection->kr_phase);
    }
}

static uint32_t beacon_packet_send_to_all(const nrf_mesh_beacon_secmat_t * p_beacon_secmat,
                                          uint32_t iv_index,
                                          net_state_iv_update_t iv_update,
                                          bool key_refresh)
{
    uint32_t status = NRF_SUCCESS;
    for (uint32_t i = 0; i < MESH_GATT_CONNECTION_COUNT_MAX; ++i)
    {
        if (m_connections[i].connected)
        {
            if (beacon_packet_send(&m_connections[i],
                                   p_beacon_secmat,
                                   iv_index,
                                   iv_update,
                                   key_refresh) != NRF_SUCCESS)
            {
                status = NRF_ERROR_NO_MEM;
            }
        }
    }
    return status;
}

static bool config_packet_decrypt(network_packet_metadata_t * p_net_meta,
                                  const uint8_t * p_data,
                                  uint32_t length,
                                  uint8_t * p_decrypted)
{
    uint32_t status = net_packet_decrypt(p_net_meta,
                                         length,
                                         (const packet_mesh_net_packet_t *) p_data,
                                         (packet_mesh_net_packet_t *) p_decrypted,
                                         NET_PACKET_KIND_PROXY_CONFIG);

    if (status == NRF_SUCCESS)
    {
        /* Validate metadata */
        return (p_net_meta->control_packet && p_net_meta->ttl == 0 &&
                p_net_meta->dst.value == NRF_MESH_ADDRESS_TYPE_INVALID);
    }
    else
    {
        return false;
    }
}

static uint32_t config_packet_buffer_len(uint32_t msg_len)
{
    return PACKET_MESH_NET_PDU_OFFSET + msg_len + net_packet_mic_size_get(true);
}

static proxy_config_msg_t * config_packet_alloc(proxy_connection_t * p_connection, uint32_t msg_len)
{
    if (packet_alloc(p_connection,
                     MESH_GATT_PDU_TYPE_PROXY_CONFIG,
                     config_packet_buffer_len(msg_len),
                     NRF_MESH_INITIAL_TOKEN) == NRF_SUCCESS)
    {
        return (proxy_config_msg_t *) net_packet_payload_get(
            (packet_mesh_net_packet_t *) p_connection->p_alloc_packet);
    }

