NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/gatt/src/proxy.c
        adv_data_node_id_set(p_secmat->identity_key, src_addr);
    }
}

static void adv_timer_handler(timestamp_t timeout, void * p_context)
{
    adv_net_iterate();
    adv_data_set();
}

static void adv_start(proxy_adv_type_t proxy_adv_type, bool interleave_networks)
{
    m_advertising.type = proxy_adv_type;

    if (m_advertising.running)
    {
        mesh_adv_stop();
    }

    if (interleave_networks)
    {
        adv_net_iterate();
        timer_sch_reschedule(&m_advertising.timer, timer_now() + m_advertising.timer.interval);
    }
    else
    {
        timer_sch_abort(&m_advertising.timer);
    }

    if (proxy_adv_type == PROXY_ADV_TYPE_NETWORK_ID)
    {
        mesh_adv_params_set(MESH_ADV_TIMEOUT_INFINITE,
                            MSEC_TO_UNITS(MESH_GATT_PROXY_NETWORK_ID_ADV_INT_MS,
                                          UNIT_0_625_MS));
    }
    else
    {
        mesh_adv_params_set(MESH_GATT_PROXY_NODE_IDENTITY_DURATION_MS,
                            MSEC_TO_UNITS(MESH_GATT_PROXY_NODE_IDENTITY_ADV_INT_MS,
                                          UNIT_0_625_MS));
    }

    adv_data_set();
    mesh_adv_start();
    m_advertising.running = true;
}

/*****************************************************************************
* Core TX callback functions
*****************************************************************************/
core_tx_alloc_result_t core_tx_packet_alloc_cb(core_tx_bearer_t * p_bearer,
                                               const core_tx_alloc_params_t * p_params)
{
    NRF_MESH_ASSERT(p_bearer && p_params);
    proxy_connection_t * p_connection = PARENT_BY_FIELD_GET(proxy_connection_t, bearer, p_bearer);

    if (p_connection->connected && proxy_filter_accept(&p_connection->filter, p_params->p_metadata->dst.value))
    {
        uint32_t status = packet_alloc(p_connection, MESH_GATT_PDU_TYPE_NETWORK_PDU, p_params->net_packet_len, p_params->token);

        return ((status == NRF_SUCCESS) ? CORE_TX_ALLOC_SUCCESS : CORE_TX_ALLOC_FAIL_NO_MEM);
    }
    else
    {
        return CORE_TX_ALLOC_FAIL_REJECTED;
    }
}

void core_tx_packet_send_cb(core_tx_bearer_t * p_bearer, const uint8_t * p_packet, uint32_t packet_length)
{
    NRF_MESH_ASSERT(p_bearer && p_packet);
    proxy_connection_t * p_connection = PARENT_BY_FIELD_GET(proxy_connection_t, bearer, p_bearer);
    NRF_MESH_ASSERT(p_connection->p_alloc_packet);

    memcpy(p_connection->p_alloc_packet, p_packet, packet_length);
    packet_send(p_connection);
}

void core_tx_packet_discard_cb(core_tx_bearer_t * p_bearer)
{
    NRF_MESH_ASSERT(p_bearer);
    proxy_connection_t * p_connection = PARENT_BY_FIELD_GET(proxy_connection_t, bearer, p_bearer);
    packet_discard(p_connection);
}
/*****************************************************************************
* Interface functions
*****************************************************************************/
void proxy_init(void)
{
    mesh_gatt_uuids_t uuids = {.service = PROXY_UUID_SERVICE,
                               .tx_char = PROXY_UUID_CHAR_TX,
                               .rx_char = PROXY_UUID_CHAR_RX};
    mesh_gatt_init(&uuids, gatt_evt_handler, NULL);
    m_mesh_evt_handler.evt_cb = mesh_evt_handle;
    nrf_mesh_evt_handler_add(&m_mesh_evt_handler);

    m_beacon_cache.array_len = MESH_GATT_PROXY_BEACON_CACHE_SIZE;
    m_beacon_cache.elem_array = m_beacon_cache_entries;
    m_beacon_cache.elem_size = sizeof(sizeof(beacon_cache_entry_t));
    cache_init(&m_beacon_cache);

    m_advertising.timer.cb = adv_timer_handler;
    m_advertising.timer.interval = ADV_NETWORK_ITERATE_INTERVAL_US;
    m_advertising.running        = false;
    for (uint32_t i = 0; i < MESH_GATT_CONNECTION_COUNT_MAX; ++i)
    {
        core_tx_bearer_add(&m_connections[i].bearer, &m_interface, CORE_TX_BEARER_TYPE_GATT_SERVER);
        m_connections[i].connected = false;
    }

    /* NOTE: We're not setting the m_enabled state here. It is stored in zero-initialized memory and
     * set by mesh_config_load() which _has to be called before this function_.
     *
     * The reason is that this function shall only be called if the device has been provisioned,
     * otherwise it will add the Proxy Service to the GATT database (through mesh_gatt_init(...)).
     */
}

uint32_t proxy_start(void)
{
    if (m_enabled)
    {
        if (!m_advertising.running)
        {
            m_advertising.p_net_beacon_info = NULL;
            adv_start(PROXY_ADV_TYPE_NETWORK_ID, true);
        }
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_INVALID_STATE;
    }
}

uint32_t proxy_stop(void)
{
    if (m_enabled)
    {
        proxy_disconnect();
        if (m_advertising.running)
        {
            mesh_adv_stop();
            on_adv_end();
        }

        m_enabled = false;
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_INVALID_STATE;
    }
}

void proxy_subnet_added(uint16_t net_key_index, const uint8_t * p_network_id)
{
    NRF_MESH_ASSERT(p_network_id);
    const nrf_mesh_beacon_info_t * p_beacon_info = NULL;
    nrf_mesh_key_refresh_phase_t kr_phase;
    nrf_mesh_beacon_info_next_get(p_network_id, &p_beacon_info, &kr_phase);
    NRF_MESH_ASSERT(p_beacon_info);

    (void) beacon_packet_send_to_all(nrf_mesh_beacon_secmat_from_info(p_beacon_info, kr_phase),
                                     net_state_beacon_iv_index_get(),
                                     net_state_iv_update_get(),
                                     net_beacon_key_refresh_flag(kr_phase));
}

void proxy_net_packet_processed(const network_packet_metadata_t * p_net_metadata, const nrf_mesh_rx_metadata_t * p_rx_meta)
{
    if (p_rx_meta->source == NRF_MESH_RX_SOURCE_GATT)
    {
        proxy_connection_t * p_connection = &m_connections[p_rx_meta->params.gatt.connection_index];

        if (p_connection->connected)
        {
            if (p_connection->filter.type == PROXY_FILTER_TYPE_WHITELIST)
            {
                proxy_filter_add(&p_connection->filter, &p_net_metadata->src, 1);
            }
            else
            {
                proxy_filter_remove(&p_connection->filter, &p_net_metadata->src, 1);
            }
        }
    }
}

bool proxy_node_id_is_enabled(const nrf_mesh_beacon_info_t * p_beacon_info)
{
    return (m_enabled &&
            m_advertising.running &&
            m_advertising.type == PROXY_ADV_TYPE_NODE_ID &&
            (p_beacon_info == NULL || p_beacon_info == m_advertising.p_net_beacon_info));
}

