NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/gatt/src/proxy.c
bool proxy_is_enabled(void)
{
    return m_enabled;
}

bool proxy_is_connected(void)
{
    return (m_enabled && active_connection_count() > 0);
}

void proxy_disconnect(void)
{
    for (uint32_t i = 0; i < MESH_GATT_CONNECTION_COUNT_MAX; ++i)
    {
        if (m_connections[i].connected)
        {
            (void) mesh_gatt_disconnect(i);
            m_connections[i].connected = false;
        }
    }
}

uint32_t proxy_enable(void)
{
    return mesh_opt_gatt_proxy_set(true);
}

void proxy_disable(void)
{
    (void) mesh_opt_gatt_proxy_set(false);
}

uint32_t proxy_node_id_enable(const nrf_mesh_beacon_info_t * p_beacon_info, nrf_mesh_key_refresh_phase_t kr_phase)
{
    if (active_connection_count() >= MESH_GATT_CONNECTION_COUNT_MAX)
    {
        return NRF_ERROR_BUSY;
    }
    else
    {
        /* If the Node ID is already enabled, we'll restart the counter now. */
        m_advertising.p_net_beacon_info = p_beacon_info;
        m_advertising.kr_phase          = kr_phase;
        adv_start(PROXY_ADV_TYPE_NODE_ID, (p_beacon_info == NULL));
        return NRF_SUCCESS;
    }
}

uint32_t proxy_node_id_disable(void)
{
    if (proxy_node_id_is_enabled(NULL))
    {
        /* If the Proxy state is enabled, we'll go back to advertising
         * the Network ID. */
        if (m_enabled)
        {
            adv_start(PROXY_ADV_TYPE_NETWORK_ID, true);
        }
        else
        {
            mesh_adv_stop();
            on_adv_end();
        }
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_INVALID_STATE;
    }
}

/*****************************************************************************
 * Mesh config wrappers
 *****************************************************************************/

static uint32_t proxy_set(mesh_config_entry_id_t id, const void * p_entry)
{
    const bool enable = *((bool *) p_entry);

    if (enable && !m_enabled)
    {
        m_enabled = true;
        return NRF_SUCCESS;
    }
    else if (!enable && m_enabled)
    {
        m_enabled = false;

        if (m_advertising.running)
        {
            mesh_adv_stop();
            on_adv_end();
        }

        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_INVALID_STATE;
    }
}

static void proxy_get(mesh_config_entry_id_t id, void * p_entry)
{
    bool * p_enabled = p_entry;
    *p_enabled = proxy_is_enabled();
}

MESH_CONFIG_ENTRY(mesh_opt_gatt_proxy,
                  MESH_OPT_GATT_PROXY_EID,
                  1,
                  sizeof(bool),
                  proxy_set,
                  proxy_get,
                  NULL,
                  true);

uint32_t mesh_opt_gatt_proxy_set(bool enabled)
{
    return mesh_config_entry_set(MESH_OPT_GATT_PROXY_EID, &enabled);
}

uint32_t mesh_opt_gatt_proxy_get(bool * p_enabled)
{
    return mesh_config_entry_get(MESH_OPT_GATT_PROXY_EID, p_enabled);
}

#endif /* MESH_FEATURE_GATT_PROXY_ENABLED */
